from aiogram import types
from loader import dp, bot
from aiogram.types import InlineKeyboardButton, InlineKeyboardMarkup


@dp.message_handler(text="🤝 Оферта")
async def bot_offer(message: types.Message):
    offer = "\n".join(
        [
            'Дана оферта на укладення угоди направлена на партнерство з питань надання послуг із видачі фінансових гарантій',
            'Співпраця з нами передбачає ряд переваг для Вас:',
            '❗️ швидке та цілодобове 24/7 здійснення оформлення/видачі фінансових гарантій;',
            '❗️ можливість завчасного та зручного отримання фінансової гарантії;',
            '❗️ отримання компетентної консультативної підтримки у роботі з митними органами;',
            '❗️ використання сучасних технологій та програмного забезпечення;',
            '❗️ вивільнення ваших грошових коштів (не потрібно оформлювати банківські кредити та/або резервувати гроші на депозитному рахунку митних органів під забезпечення дотримання митного режиму, розстрочення платежів та доставки товарів від митниці відправлення до митниці призначення);',
            '❗️ економічність, в тому числі фінансова, у порівнянні з іншими способами забезпечення сплати митних платежів;',
            '❗️ постійний розвиток та впровадження інноваційних технологій з видачі фінансових гарантій.',
            'Для користування цими перевагами пропонуємо Вам зробити перший крок і заповнити коротку форму за посиланням нижче.'
        ]
    )  
    await message.answer('<b>ОФЕРТА</b>')
    link_markup = InlineKeyboardMarkup(
        inline_keyboard=[
            [
                InlineKeyboardButton(text="🤝 Стати партнером...", url='https://docs.google.com/forms/d/e/1FAIpQLSdWUJkE8P90gTlR51mLiez0DeNqOMIRi5rmiOxaU2-VXatQZg/viewform?usp=sf_link'),
            ],
        ],
    )
    await message.answer(offer, reply_markup=link_markup)